#+title: Client Server Socket Example
#+author: Marcus Birkenkrahe (pledged)
#+SEQ_TODO: TODO NEXT IN_PROGRESS | DONE
#+startup: overview hideblocks indent entitiespretty:
#+property: header-args:C :main yes :includes <stdio.h> :results output :exports both:
#+property: header-args:python :session *Python* :python python3 :results output :exports both:
#+property: header-args: R :session *R* :results output :exports both:
#+property: header-args:C++ :main yes :includes <iostream> :results output :exports both:
* Create TCP client socket

- Include standard header files:
  #+name: standard header files
  #+begin_src C :results none
    #include <stdio.h>
    #include <stdlib.h>
  #+end_src

- Include several special header files
  #+name: network header files
  #+begin_src C :results none
    #include <sys/types.h>
    #include <sys/socket.h>
    #include <netinet/in.h>
    #include <unistd.h>
  #+end_src

- Main program:
  #+begin_src C :noweb yes :tangle ./src/tcp_client.c :includes :main no
    <<standard header files>>
    <<network header files>>

    #define PORT 9002
    int main(void)
    {
      // Redirect stderr to stdout
      dup2(1,2);
      
      // create a socket
      int network_socket;
      // Use IPv4, TCP, default protocol
      network_socket = socket(AF_INET,SOCK_STREAM,0);

      // specify an address for the socket
      struct sockaddr_in server_address;
      server_address.sin_family = AF_INET; // IPv4
      server_address.sin_port = htons(PORT); // Convert port number
      server_address.sin_addr.s_addr = INADDR_ANY; // Use 0.0.0.0

      // connect to socket
      int connection_status =  // return 0 if ok, or -1
        connect(network_socket,
                (struct sockaddr *) &server_address,
                sizeof(server_address));
      // check for error with connection
      if (connection_status == -1) {
        perror("Connection error");
      }

      // receive some data from the server
      char server_response[250]; // empty string to hold data
      recv(network_socket,&server_response,sizeof(server_response),0);

      // print the data that we get back
      if (connection_status == 0) {
        printf("The server sent the data: %s",server_response);
      }

      // close the socket - unistd.h
      close(network_socket);
      return 0;
    }
  #+end_src

  #+RESULTS:
  : Connection error: Connection refused

- To test, run this and you should get the output:
  #+begin_example
   Connection error: Connection refused.
  #+end_example

* TODO Byte order

- Hexadecimal is a human-friendly shorthand for binary. Memory
  addresses, file contents, network packets, color codes etc.

- Example:
  #+begin_src C
    int i = 1;
    int *p = &i;
    printf("The hex address of i = %d is %p.\n",i,&p);
  #+end_src

  #+RESULTS:
  : The hex address of i = 1 is 0x7fff76a2c990.

- Hex to decimal can be computed easily on the shell with ~bc~:
  #+begin_src bash :results output :exports both
    echo "ibase=16; B34F" | bc
    echo "obase=2;ibase=16; B34F" | bc
  #+end_src

  #+RESULTS:
  : 45903
  : 1011001101001111

- How does the hexadecimal -> decimal result come about?
  #+begin_quote
  | Pos | Hex | Decimal | 16^Pos | Contribution      |
  |-----+-----+---------+--------+-------------------|
  |   3 | B   |      11 |   4096 | 11 × 4096 = 45056 |
  |   2 | 3   |       3 |    256 | 3 × 256 = 768     |
  |   1 | 4   |       4 |     16 | 4 × 16 = 64       |
  |   0 | F   |      15 |      1 | 15 × 1 = 15       |
  |-----+-----+---------+--------+-------------------|
  |     |     |         |        | Total = *45903*     |
  #+end_quote
  #+begin_example
  Decimal:  0  1  2  3  4  5  6  7  8  9  10 11 12 13 14 15
  Hex:      0  1  2  3  4  5  6  7  8  9   A  B  C  D  E  F
  #+end_example

- Two-byte hexadecimal numbers like =B34F= (two words), are stored in
  sequential bytes - B3 followed by 4F. This number, stored with the
  "Big End" (B3) first, is called "Big-Endian".

- Intel- or Intel-compatible computers store the bytes reversed: So in
  memory, B34F is stored as the sequential bytes 4F followed by
  B3. This is called "Little-Endian" (little end first).

- "Big-Endian" is also called "Network Byte Order".

- Your computer stores numbers in "Host Byte Order". If the CPU's an
  Intel 80x86, Host Byte Order is Little-Endian. If it's a
  PowerPC..who knows.

- So you need to make sure two- and four-byte numbers are in Network
  Byte Order. This is what ~htons~ does for ~short~ (two bytes - used for
  port numbers, TCP headers, checksums) and ~htonl~ for ~long~ (four
  bytes - used for IPv4 addresses, TCP SEQ and ACK numbers, and
  timestamps).

- You can use different combinations:

  | *Function* | *Description*           |
  |----------+-----------------------|
  | ~htons~    | host to network short |
  | ~htonl~    | host to network long  |
  | ~ntohs~    | network to host short |
  | ~ntohl~    | network to host long  |

- Example:
  #+begin_src C :main no :includes :tangle htons.c
    #include <stdio.h>
    #include <arpa/inet.h> // contains `htons`

    #define PORT 9002

    int main(void)
    {
      printf("Port %hu = Host Byte Order | %X = Network Byte Order\n",
    	 PORT, htons(PORT));
      return 0;
    }
     #+end_src

     #+RESULTS:
     : Port 9002 = Host Byte Order | 2A23 = Network Byte Order

- Confirm using ~bc~:
  #+begin_src bash :results output :exports both
    echo "obase=16; ibase=10; 9002" | bc
  #+end_src

  #+RESULTS:
  : 232A

